src/com/shuohe/GuoNengBattery/SendInstantSms.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ful="http://schemas.datacontract.org/2004/07/FullScreen.Models">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetAllSerializedRealTimeCarParameter>
         <!--Optional:-->
         <tem:terminals>
            <!--Zero or more repetitions:-->
            <ful:RealTimeTerminaItem>
               <!--Optional:-->
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <!--Optional:-->
               <ful:TerminalCode>50007435</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
              <ful:RealTimeTerminaItem>
               <!--Optional:-->
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <!--Optional:-->
               <ful:TerminalCode>50022442</ful:TerminalCode>
            </ful:RealTimeTerminaItem>

         </tem:terminals>
      </tem:GetAllSerializedRealTimeCarParameter>
   </soapenv:Body>
</soapenv:Envelope>